use mydb;

insert ignore into body
values 
  (1, 'Универсал'), 
  (2, 'Хэтчбек'), 
  (3, 'Лифтбек'), 
  (4, 'Купе'), 
  (5, 'Лимузин'), 
  (6, 'Кабриолет'), 
  (7, 'Внедорожник'), 
  (8, 'Седан'), 
  (9, 'Микроавтобус');
insert ignore into model
values 
  (1, 'Camry'), 
  (2, 'Pr`ius'), 
  (3, 'Corolla'), 
  (4, 'Highlander'), 
  (5, 'Land Cruiser '), 
  (6, 'C-Klasse'), 
  (7, 'S-Klasse'), 
  (8, 'GL-Klasse'), 
  (9, 'V-Klasse'), 
  (10, 'E-Klasse'), 
  (11, '6-Series'), 
  (12, 'X6'), 
  (13, 'X5'), 
  (14, 'X4'), 
  (15, 'M3'), 
  (16, 'Insight'), 
  (17, 'Fit'), 
  (18, 'Odyssey'), 
  (19, 'Ridgeline'), 
  (20, 'Accord'), 
  (21, 'Passat'), 
  (22, 'Touareg'), 
  (23, 'Tiguan'), 
  (24, 'Phaeton'), 
  (25, 'Scirocco');
insert ignore into brand 
values 
  (1, 'Toyota', 1), 
  (2, 'Mercedes-Benz', 6), 
  (3, 'BMW', 11), 
  (4, 'Honda', 16), 
  (5, 'Volkswagen', 21);
  
insert ignore into color
values
(1, 'black'),
(2, 'white'),
(3, 'silver'),
(4, 'grey'),
(5, 'graphite');

insert ignore into consumables
values
(1, 'Тормозные колодки передние Тойота Камри 70', 2300 ),
(2, 'Тормозные колодки VAG', 16000 ),
(3, 'Моторное масло Total Quartz 9000 HKS G-310 5W-30, 1л', 1300 ),
(4, 'Моторное масло Total Quartz 9000 HKS G-310 5W-30 5L', 5600),
(5, 'Тормозная жидкость Reinwell DOT4 1 л', 400 ),
(6, 'Тормозная жидкость Renault DOT 4+ (0,5 л)', 1900),
(7, 'Фиксатор автомобильный, 100 шт.', 624),
(8, 'Гайка колесная автомобильная конус 20 шт.', 1333),
(9, 'Шины зимние Sailun Ice Blazer WST3 104T Шипованные', 7890),
(10, 'Шины зимние Yokohama iceGuard iG55 94T Шипованные',6600);

insert ignore into fuel
values
(1, 'Дизель'),
(2, 'Бензин-95'),
(3, 'Бензин-98'),
(4, 'Газ');

insert ignore into engines
values
(1, 'Mitsubishi 4G63', 144, 1997, 1),
(2, 'Mercedes-Benz OM642', 235, 2987, 1),
(3, 'BMW M57', 286, 2993, 2),
(4, 'Volvo D5', 230, 2400, 3),
(5, 'VW CFNA', 105, 1598, 3);

insert ignore into service
values
(1, 'Замена воздушного фильтра двигателя', 1, 1000, 1),
(2, 'Профилактика торм. механизма', 1, 1500, 3),
(3, 'Замена фильтра салона', 1, 1000, 5),
(4, 'Замена фильтра ДВС', 1, 1000, 6),
(5, 'Шприцевание крестовин карданного вала', 1, 2000, 2);

insert ignore into car
values
(1, 'J73dXV0M3dJDMsRdy', 2014, 30000, 'c245co', 1, 1, 1, 1),
(2, 'u4wvjzN5fgDQtcrn1', 2016, 15000, 'с395мо', 2, 2, 2, 2),
(3, 'vdXmSVqtq5Oabdu3z', 2010, 100000, 'п129шо', 3, 3, 3, 3),
(4, 'Sj9wf4FKP9N3fPtlC', 2012, 80000, 'ж154ма', 4, 4, 4, 4),
(5, 'H5q0pHV6HX16XBN1t', 2012, 75000, 'о490ле', 5, 5, 5, 5);

insert ignore into clients
values
(1, 'Андрей', 'Ершов', 'Егорович', 79959341288, 'Пр. Пушкина дом 15, квартира 14', 4964, 357274), 
(2, 'Марфа', 'Зууфина', 'Елизаровна', 79623434669, 'Ул. Достоевского пд. 4, 5', 4398, 997761), 
(3, 'Жванеца', 'Марина', 'Денисовна', 79284819129, 'Ул. Ленина дом 12', 4930, 901786), 
(4, 'Бессмертных', 'Петр', 'Власович', 79812428277, 'Пр. Грибоедова дом 15, квартира 14', 4950, 727113), 
(5, 'Казаков', 'Иван', 'Аркадьевич', 79623434669, 'Ул. Жукова пд. 4, 5', 4585, 467987);

insert ignore into orders
values
(1, '2019-04-12', '2019-04-15', 1, 1, 1),
(2, '2020-06-08', '2020-06-10', 2, 2, 2),
(3, '2019-02-13', '2019-02-16', 3, 3, 3),
(4, '2019-04-24', '2019-04-29', 4, 4, 4),
(5, '2020-03-08', '2020-03-10', 5, 5, 5);
